{"events":[{"id":"341d9b5e87592b71233c1d57aa6298cb","name":"John Deere Q&A","description":"Come and find out more about what our Title Sponsor John Deere does! Come and learn about one of the biggest manufacturers of agricultural machinery as well as the various recruitment opportunities at John Deere during this Company Q&A.\n\nFun Fact: John Deere has an office at the University of Illinois Research Park!\n\nEvent Link: https://hackillinois.org/zoom/john-deere-qa","isAsync":false,"startTime":1645840800,"endTime":1645844400,"locations":[],"sponsor":"John Deere","eventType":"QNA","points":150},{"id":"8246ed56756b577007be3f525e14a644","name":"Opening Ceremony","description":"Gather all the ingredients for the best weekend of your life! Join for a quick overview of HackIllinois and the events to come in the next few days!\n\nEvent Link: https://go.hackillinois.org/opening-ceremony","isAsync":false,"startTime":1645833600,"endTime":1645835400,"locations":[],"sponsor":"","eventType":"OTHER","points":10},{"id":"485e7a456d410cba8abb7b0b30893b5c","name":"Hackathon Crash Course","description":"Learn the basics of git, one of the most popular applications for code collaboration! We will help you get (or should we say git) good while also teaching you how to navigate a Linux shell. In addition, we'll also show you to use Discord for team formation as well as do some activities to help you find teammates! This event is perfect for first-time and returning hackers! \n\nEvent Link: https://hackillinois.org/zoom/crash-course","isAsync":false,"startTime":1645835400,"endTime":1645840800,"locations":[],"sponsor":"","eventType":"WORKSHOP","points":100},{"id":"351a5be44803b654ff5db48550ef3ce8","name":"Intro to Web Dev/React","description":"Join us for the Intro to Web Development Workshop, where software engineers from Meta (formerly Facebook) will guide you through principles of React for frontend web development. Learn how to make your ideas come to life using industry-standard web development techniques. \n\nFun fact: React was created by Jordan Walke, a software engineer at Facebook, in 2011.\n\nEvent Link: https://hackillinois.org/zoom/web-dev","isAsync":false,"startTime":1645844400,"endTime":1645848000,"locations":[],"sponsor":"Meta","eventType":"WORKSHOP","points":100},{"id":"1c43b71d9bfba36296b13fac3d7e4098","name":"League of Legends Tournament","description":"Cook up a battle in League of Legends! Play with old and new friends or watch the tournament on Discord—let the games begin!","isAsync":false,"startTime":1645851600,"endTime":1645860600,"locations":[],"sponsor":"","eventType":"MINIEVENT","points":50},{"id":"4dccd87449f73cfde2d7b1e6a79c2a78","name":"Type Racer Tournament","description":"Sprinkle a little bit of TypeRacer into your day by joining the Type Racer tournament and competing against your friends!\n\nEvent Link: https://hackillinois.org/zoom/typeracer","isAsync":false,"startTime":1645851600,"endTime":1645857000,"locations":[],"sponsor":"","eventType":"MINIEVENT","points":50},{"id":"2a781a1f342ac59d924707b93eb008f0","name":"Intro to API Workshop","description":"Wayfair welcomes you to join our \"Intro to APIs\" workshop hosted by Staff Software Engineer, Shai Sachs. Application Programming Interfaces (APIs) are a fundamental building block of modern software architecture. In this workshop, we will talk about what APIs are, how they work, and some of the cool things you can do with them! See you there!\n\nEvent Link: https://hackillinois.org/zoom/api-workshop","isAsync":false,"startTime":1645887600,"endTime":1645891200,"locations":[],"sponsor":"Wayfair","eventType":"WORKSHOP","points":100},{"id":"f92cb0cbf37c01f037364a6400deb8dd","name":"Intro to Android Programming","description":"Interested in learning how to develop Android apps? Want to make the next Snapchat? Join Temidayo Adefioye, founder of CodeNest Africa and Google Certified Associate Android Developer, as he goes over the basics of Android Programming! No prior experience necessary, this workshop will introduce current trends of the Mobile Technology space, basic Java programming skills and how it works under the hood, and as well as the Flutter framework for Android development. \n\nEvent Link: https://hackillinois.org/zoom/android","isAsync":false,"startTime":1645891200,"endTime":1645894800,"locations":[],"sponsor":"","eventType":"WORKSHOP","points":100},{"id":"30fbd7ccb558775d6eb3c6e6dea87f9a","name":"IMC Trading Q&A","description":"IMC Trading is a leading global trading firm and a leader in market making around the world. Come learn about what they do and how you can get involved with IMC Trading! Bring any questions you've got and ask away!\n\nEvent Link: https://hackillinois.org/zoom/imc-qa","isAsync":false,"startTime":1645896600,"endTime":1645900200,"locations":[],"sponsor":"IMC Trading","eventType":"QNA","points":150},{"id":"1ef8c01b4d7653f6c0307e619c0266e2","name":"Intro to UI/UX","description":"UI/UX design is crucial to making your project easy-to-use, visually appealing, and accessible. Learn how to design solutions that solve real problems and maximize usability, in this workshop brought to you by industry professionals from John Deere!\n\nEvent Link: https://hackillinois.org/zoom/uiux","isAsync":false,"startTime":1645902000,"endTime":1645905600,"locations":[],"sponsor":"John Deere","eventType":"WORKSHOP","points":100},{"id":"e419bd290a5b445777ddac52cfd0a53b","name":"Code in the Dark","description":"Think you're a reverse engineering pro? See how you fare by coding in the dark, where you'll have to recreate a webpage after getting just a quick look at it. Whether you're an HTML pro or someone just getting into building websites, Code in the Dark is the perfect way to hone your frontend skills.\n\nEvent Link: https://hackillinois.org/zoom/code-in-the-dark ","isAsync":false,"startTime":1645905600,"endTime":1645909200,"locations":[],"sponsor":"Caterpillar","eventType":"MINIEVENT","points":50},{"id":"5f2fc4beafa919f15661451a5d25558f","name":"Intro to Data Science","description":"Discover real-world applications of data science with experts from BlueBonnet, a nonprofit with the mission of democratizing data! This workshop will go over how to select the perfect dataset for your project and techniques for data visualization in python. Come learn how you can analyze and transform data to provide valuable insight. \n\nEvent Link: https://hackillinois.org/zoom/data-science","isAsync":false,"startTime":1645911000,"endTime":1645914600,"locations":[],"sponsor":"","eventType":"WORKSHOP","points":100},{"id":"c47d1c8b2e2e854c472d2b15798ab261","name":"Caterpillar Q&A","description":"Caterpillar, one of our returning sponsors for HackIllinois 2022, is an American Fortune 100 corporation that focuses on construction machinery and equipment. Come find out more about what Caterpillar does and learn about various recruitment opportunities at Caterpillar especially within the University of Illinois Research Park!\n\nEvent Link: https://hackillinois.org/zoom/caterpillar-qa","isAsync":false,"startTime":1645914600,"endTime":1645918200,"locations":[],"sponsor":"Caterpillar","eventType":"QNA","points":150},{"id":"1111aad4fcb9ca2f1f1adb4b03a4b729","name":"Cybersecurity - Web Exploit","description":"Collaborate and follow along on a journey to find, evaluate, and exploit a web vulnerability.  Get root on the webserver and talk in detail about how we got there and how to defend against it.  We’ll work on recon, research, exploitation, and privilege escalation against a vulnerable application.\n\nEvent Link: https://hackillinois.org/zoom/cybersecurity","isAsync":false,"startTime":1645920000,"endTime":1645923600,"locations":[],"sponsor":"John Deere","eventType":"WORKSHOP","points":100},{"id":"7ac21a22aa509342b59b224ea08ae0d4","name":"Gatheround Social","description":"What’s your favorite pizza topping? Where do you want to travel next? Take a break from coding to meet other participants and make new friends! Join us on Gatheround for fun discussion and networking through small groups and speed-friending.\n\nhttps://go.hackillinois.org/gatheround","isAsync":false,"startTime":1645923600,"endTime":1645927200,"locations":[],"sponsor":"","eventType":"MINIEVENT","points":50},{"id":"1f5fe88602fbf413f953314430457403","name":"Intro to Databases","description":"We're excited to partner with Caterpillar, Hack4Impact and Women in Computer Science to bring to you a hands-on, interactive MongoDB workshop. Through a tutorial, explorative demos, and fun activity, you can learn how to incorporate databases for information storage and retrieval to take your project to the next level! \n\nHack4Impact (uiuc.hack4impact.org) is a student-run organization that works with non-profits across the world to build well-engineered products for social change. Women in CS (wcs.illinois.edu/) is a group dedicated to supporting women in tech by providing them technical and professional development opportunities.\n\nEvent Link: https://hackillinois.org/zoom/databases","isAsync":false,"startTime":1645934400,"endTime":1645938000,"locations":[],"sponsor":"Caterpillar","eventType":"WORKSHOP","points":100},{"id":"48dde7f586bb562fedec59e37fdfd08b","name":"Project Submission Office Hours","description":"Struggling with submitting your project on DevPost? Head to Project Submission Office Hours to get help!","startTime":1645974000,"endTime":1645976700,"locations":[],"sponsor":"","eventType":"OTHER","points":0},{"id":"a84cc1dd1f86741deafcc8f465ec006f","name":"Shark Tank","description":"Think you could pitch at Shark Tank? Here’s your chance! With nothing more than an idea and a strong entrepreneurial spirit, you could win hundreds of dollars in prizes. This event provides a unique opportunity to receive feedback from real entrepreneurs and VCs. Come see if you can create the next big start-up!\n\nThis year, the judge panel for Shark Tank features Brad Schnitzer (Founder of TechStars), Patrick Casey (Illinois Ventures), Lilliana de Souza Robinson (TechStars), and Gabe Price (iVenture Accelerator Coordinator).\n\nSign up to compete at https://go.hackillinois.org/shark-tank-signup","isAsync":false,"startTime":1645984800,"endTime":1645992000,"locations":[],"sponsor":"","eventType":"WORKSHOP","points":200},{"id":"6a49fa04f9bc72ccb0fc4ef1fe05a240","name":"Project Submission Deadline","description":"The egg timer is ringing! Time to get your projects out of the oven and send them over to cool. All projects must be submitted to Devpost by this time!","isAsync":false,"startTime":1645977600,"endTime":1645977600,"locations":[],"sponsor":"","eventType":"OTHER","points":0},{"id":"d64ae6c5afc2c990c4f3e6b2434b78d5","name":"Closing Ceremony","description":"Come to the Closing Ceremony for a recap of the weekend and to see the winners in each category announced! \n\nEvent Link: https://go.hackillinois.org/hackillinois-2022-closing-ceremony","isAsync":false,"startTime":1645997400,"endTime":1645999200,"locations":[],"sponsor":"","eventType":"OTHER","points":0},{"id":"24d509a053bba78cc81b334f78579311","name":"Stomp and Spray","description":"John Deere Stomp and Spray is an adaptation of the popular game Dance Dance Revolution. Players compete against a simulation of the John Deere See & Spray technology. The goal is to identify and spray all the weeds appropriately while minimizing overspray. Submissions are due at #stomp-and-spray on 27 Feb, 10AM CST!","isAsync":true,"startTime":0,"endTime":0,"locations":[],"sponsor":"John Deere","eventType":"OTHER","points":0},{"id":"e06208b170ec2d3e478284713b9f0c85","name":"Geoguessr","description":"Do you think you're good at finding your way around? Test your detective and wayfinding skills through the HackIllinois Geoguessr Challenge. We've created three exclusive Geoguessr maps for HackIllinois participants to compete on. The top 3 high scorers will receive prizes! \n\nSubmissions are due on 27 Feb, 10AM CST!","isAsync":true,"startTime":0,"endTime":0,"locations":[],"sponsor":"","eventType":"OTHER","points":0},{"id":"f3de26a77fa97f1e9c3d2fbce9b90d0d","name":"Stories from Hack Spotlight","description":"What does diversity in the workplace mean to you? How can we increase diversity in the tech industry? Share your story with the world!","isAsync":true,"startTime":0,"endTime":0,"locations":[],"sponsor":"","eventType":"OTHER","points":0}]}